using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.IO;
using System.Numerics;

namespace Algorithm_Encryption
{
    class STab
    {

        private static ulong[] S1, S2, S3, S4;

        private static readonly byte[] Sbox1 = {
            112, 130, 44, 236, 179, 39, 192, 229, 228, 133, 87, 53, 234, 12, 174, 65,
            35, 239, 107, 147, 69, 25, 165, 33, 237, 14, 79, 78, 29, 101, 146, 189,
            134, 184, 174, 143, 124, 235, 31, 206, 62, 48, 220, 95, 94, 197, 11, 26,
            166, 225, 57, 202, 213, 71, 93, 61, 217, 1, 90, 214, 81, 86, 108, 77,
            139, 13, 154, 102, 251, 204, 176, 45, 116, 18, 43, 32, 240, 177, 132, 153,
            223, 76, 203, 194, 52, 126, 118, 5, 109, 183, 169, 49, 209, 23, 4, 215,
            20, 88, 58, 97, 222, 27, 17, 28, 50, 15, 156, 22, 83, 24, 242, 34,
            254, 68, 207, 178, 195, 181, 122, 145, 36, 8, 232, 168, 96, 252, 105, 80,
            170, 208, 160, 125, 161, 137, 98, 151, 84, 91, 30, 149, 224, 255, 100, 210,
            16, 196, 0, 72, 163, 247, 117, 219, 138, 3, 230, 218, 9, 63, 221, 148,
            135,92,131,2,205,74,144,51,115,103,246,243,157,127,191,226,
            82, 155, 216, 38, 200, 55, 198, 59, 129, 150, 111, 75, 19, 190, 99, 46,
            233, 121, 167, 140, 159, 110, 188, 142, 41, 245, 249, 182, 47, 253, 180, 89,
            120, 152, 6, 106, 231, 70, 113, 186, 212, 37, 171, 66, 136, 162, 141, 250,
            114, 7, 185, 85, 248, 238, 172, 10, 54, 73, 42, 104, 60, 56, 241, 164,
            64, 40, 211, 123, 187, 201, 67, 193, 21, 227, 173, 244, 119, 199, 128, 158 
        };
        
        /// <summary>
        /// Stab1 - Stab4 Свойства, возвращающие массивы S1 - S4
        /// </summary>
        internal ulong[] Stab1
        {
            get { return S1; }
        }

        internal ulong[] Stab2
        {
            get { return S2; }
        }

        internal ulong[] Stab3
        {
            get { return S3; }
        }

        internal ulong[] Stab4
        {
            get { return S4; }
        }

        /// <summary>
        /// Конструктор, заполняющий массивы S1 - S4
        /// </summary>
        public STab()
        {
            S1 = new ulong[256];
            S2 = new ulong[256];
            S3 = new ulong[256];
            S4 = new ulong[256];

            for (int i = 0; i < 256; i++)
            {
                ulong s1 = Sbox1[i];
                ulong s2 = ((s1 << 1) | (s1 >> 7)) & 0xff;
                ulong s3 = ((s1 << 7) | (s1 >> 1)) & 0xff;
                ulong s4 = Sbox1[((i << 1) | (i >> 7)) & 0xff];
                S1[i] = S2[i] = S3[i] = S4[i] = 0;
                for (int j = 0; j < 64; j += 8)
                {
                    S1[i] |= (s1 << j);
                    S2[i] |= (s2 << j);
                    S3[i] |= (s3 << j);
                    S4[i] |= (s4 << j);
                }

            }
        }      
    }
}
